In [2]:
import pandas as pd
import numpy as np

In [10]:
data = {
    "a": [1, 2, None, 4, 0],
    "b": ["A", "B", "A", None, 0],
    "c": [None, 2.5, 3.5, 4.5, 0],
    "d": [1, 2, np.nan, np.nan, 0]
}

In [11]:
data

{'a': [1, 2, None, 4, 0],
 'b': ['A', 'B', 'A', None, 0],
 'c': [None, 2.5, 3.5, 4.5, 0],
 'd': [1, 2, nan, nan, 0]}

In [12]:
df = pd.DataFrame(data)

In [13]:
df.isna().sum()

a    1
b    1
c    1
d    2
dtype: int64

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       4 non-null      float64
 1   b       4 non-null      object
 2   c       4 non-null      float64
 3   d       3 non-null      float64
dtypes: float64(3), object(1)
memory usage: 292.0+ bytes

In [16]:
numerical_features = ["a", "c", "d"]
categorical_features = ["b"]

In [17]:
df_numerical = df[numerical_features]
df_categorical = df[categorical_features]

In [20]:
df_numerical.fillna(df_numerical.mean())

      a      c    d
0  1.00  2.625  1.0
1  2.00  2.500  2.0
2  1.75  3.500  1.0
3  4.00  4.500  1.0
4  0.00  0.000  0.0

In [21]:
df_numerical

     a    c    d
0  1.0  NaN  1.0
1  2.0  2.5  2.0
2  NaN  3.5  NaN
3  4.0  4.5  NaN
4  0.0  0.0  0.0